# Условные конструкции и операторы сравнения

# < - строго меньше
# > - строго больше
# >= - больше или равно
# <= - меншье или равно
# == - вернет True если оба операнда одинаковые (равны), иначе False
# != - вернет True если оба операнда разные, иначе False
# not - унарное отрицание, если значение равно True -> ключевое слово not сделает False и наоборот

# Операторы бывают унарные и бинарные.
# Унарные - у него один операнд, бинарные - у него два операнда,
# т.е. то, над чем проводится операция

# and - логическое и, вернет True если оба операнда равны True, иначе вернет False
# or - логическое или, вернет True если хотя бы один операнд равен True, иначе вернет False

# hours = int(input("Enter hours: "))
#
# if 12 <= hours < 24:
#     print("PM")
# elif 0 <= hours < 12:
#     print("AM")
# else:
#     print("Incorrect time")

##

# film_rating = int(input("Enter film rating: "))
#
# if film_rating == 5 or film_rating == 4:
#     print("Good")
# else:
#     print("Bad")


